from 时间线 import *
from 各部门 import *
from 贷款 import *

ins = 时间线()

"一年/1季"
ins.所有季度[0].营销部门 = 营销部门(60000, 50000, 50000, 0, 0, "")
ins.所有季度[0].人力部门 = 人力部门("高级员工*8", 0, 0, 0, 0, 0, 0, "")
ins.所有季度[0].生产部门 = 生产部门(0, 560000, 2000, 90000, 0, 0, 0,0, 0, "")
ins.新增贷款(短期贷款(0, 1617000))

"一年/2季"
ins.所有季度[1].营销部门 = 营销部门(60000, 50000, 50000, 300000, 0, "")
ins.所有季度[1].人力部门 = 人力部门("", 0, 0, 0, 0, 66500, 0, "")
ins.所有季度[1].生产部门 = 生产部门(0, 0, 0, 0, 72000, 0, 0, 0, 0, "")

"一年/3季"
ins.所有季度[2].营销部门 = 营销部门(0, 0, 0, 60500, 0, "")
ins.所有季度[2].人力部门 = 人力部门("", 135240, 0, 0, 0, 0, 0, "")
ins.所有季度[2].生产部门 = 生产部门(0, 0, 0, 315000, 72000, 0, 0, 0, 0, "")

"一年/4季"
ins.所有季度[3].营销部门 = 营销部门(0, 0, 0, 0, 0, "")
ins.所有季度[3].人力部门 = 人力部门("", 135240, 0, 0, 0, 0, 0, "")
ins.所有季度[3].生产部门 = 生产部门(0, 0, 0, 90000, 0, 0, 0, 0, 0, "")

"二年/1季"
ins.所有季度[4].营销部门 = 营销部门(0, 0, 0, 0, 0, "")
ins.所有季度[4].人力部门 = 人力部门("", 144000, 0, 0, 0, 12000, 0, "")
ins.所有季度[4].生产部门 = 生产部门(0, 0, 0, 0, 0, 0, 0, 0, -6000, "")

"二年/2季"
ins.所有季度[5].营销部门 = 营销部门(0, 0, 0, 500000, 0, "")
ins.所有季度[5].人力部门 = 人力部门("", 144000, 0, 0, 0, 0, 0, "")
ins.所有季度[5].生产部门 = 生产部门(0, 0, 0, 0, 0, 0, 0, 0, 0, "")
ins.所有季度[5].收入 = 850260

"二年/3季"
ins.所有季度[6].营销部门 = 营销部门(0, 0, 0, 0, 0, "")
ins.所有季度[6].人力部门 = 人力部门("", 144000, 0, 0, 0, 0, 0, "")
ins.所有季度[6].生产部门 = 生产部门(0, 0, 0, 0, 0, 0, 0, 0, 0, "")

"二年/4季"
ins.所有季度[7].营销部门 = 营销部门(0, 0, 0, 0, 0, "")
ins.所有季度[7].人力部门 = 人力部门("", 144000, 0, 0, 0, 0, 0, "")
ins.所有季度[7].生产部门 = 生产部门(0, 0, 0, 0, 0, 0, 0, 0, 0, "")

"三年/1季"
ins.所有季度[8].营销部门 = 营销部门(0, 0, 0, 800000, 0, "")
ins.所有季度[8].人力部门 = 人力部门("", 0, 0, 0, 0, 0, 0, "")
ins.所有季度[8].生产部门 = 生产部门(0, 0, 0, 0, 0, 0, 0, 0, 0, "")

for i in range(16):
    营销预算 = ins.所有季度[i].营销部门.合计()
    人力预算 = ins.所有季度[i].人力部门.合计()
    生产预算 = ins.所有季度[i].生产部门.合计()
    pass

ins.刷新()
ins

结算季 = 4

print("收入", ins.所有季度[结算季].收入)

print("广告投资：", sum(季.营销部门.广告投资 for 季 in ins.所有季度[:结算季]))
print("开拓市场：", sum(季.营销部门.开拓市场 for 季 in ins.所有季度[:结算季]))
print("质量认证：", sum(季.营销部门.质量认证 for 季 in ins.所有季度[:结算季]))
print("资格认证：", sum(季.营销部门.资格认证 for 季 in ins.所有季度[:结算季]))

print("产品设计：", sum(季.生产部门.产品设计 for 季 in ins.所有季度[:结算季]))
print("生产线：", sum(季.生产部门.生产线 for 季 in ins.所有季度[:结算季]))
print("原材料：", sum(季.生产部门.原材料 for 季 in ins.所有季度[:结算季]))

print("激励：", sum(季.人力部门.激励 for 季 in ins.所有季度[:结算季]))
print("薪资：", sum(季.人力部门.薪资 for 季 in ins.所有季度[:结算季]))
